{
  "sictone": {
    "name": "Sictone",
    "info": "Sictone is an exciting event spread across three challenging and  nteractive rounds. Participants will engage in activities that test their abilities to accurately convey messages, recall and identify lyrics, and solve puzzles under time constraints. This event promises to be a fun-filled experience that will keep participants on their toes as they compete for the top spot. <br /> <br /> The first round will be conducted online, via a Gmeet. Based on the Number of registration the Gmeet will be held in 1 or 2 slots where Cinematic Quizzes will be conducted through mentimeter platform. Based on rank up totally 15 to 20 teams will be selected.",
    "image": "/events/sictone-poster.jpg",
    "rounds": [
      {
        "mode": "Online",
        "name": "Sound Savvy",
        "date": "September 09, 2024",
        "time": "1 minute per team",
        "info": "Teams will stand in a line, each participant wearing headphones. The first participant whispers a sentence to the next person in line, who then passes it on. The goal is to accurately convey the sentence through whispers within the time limit. The team with the most accurate message wins this round."
      },
      {
        "mode": "Offline",
        "name": "Lyric Looty",
        "date": "September 11, 2024",
        "time": "Varies per turn",
        "info": "In this round, teams will be presented with five songs that have missing lyrics. Each team will take turns trying to fill in the blanks with the correct lyrics. Points are awarded for each correct answer, and teams with the highest scores will advance to the next round."
      },
      {
        "mode": "Offline",
        "name": "Mind Spark",
        "date": "September 11, 2024",
        "time": "2 minutes per puzzle",
        "info": "Participants will be given a puzzle to solve within 2 minutes. Each team member has 20 seconds to work on the puzzle before passing it to the next teammate. The team that solves the puzzle the fastest, or makes the most progress within the time limit, wins this final round."
      }
    ],
    "instructions": "Points will be awarded in each round based on the team's performance. The team with the highest total points at the end of all three rounds will be declared the winner. All team members must participate in each round as per the round-specific instructions. Teamwork and collaboration are crucial for success in this event.",
    "venue": "To be decided",
    "last-date": "September 7, 2024 (10:00 AM)",
    "form-link": "https://docs.google.com/forms/d/e/1FAIpQLSftEk-yNAwzs8pZv8giLPH8q0OEcX1CqLTYRWxROXGtu3i2ZA/viewform",
    "group-link": "https://chat.whatsapp.com/",
    "brochure-link": "/events/sictone-brochure.jpg",
    "coordinators": [
      {
        "name": "Mohammed Rizwan M",
        "phone": "+91 78716 02241",
        "type": "Student"
      },
      {
        "name": "Keerthi R",
        "phone": "+91 93421 76649 ",
        "type": "Student"
      },
      {
        "name": "Ms. Kalpana",
        "phone": "+91 95856 18987",
        "type": "Staff"
      }
    ],
    "team": "Group of 3",
    "reporting-time": "9:00 AM"
  },
  "cryptic-heist": {
    "name": "Cryptic Heist",
    "info": "'Cryptic Heist' is an exciting online event that combines the thrill of a heist with the challenge of solving tech-based puzzles. Participants will navigate through a series of fun and engaging challenges, including code-breaking, QR code hunts, and logic puzzles. As they progress, they'll gather clues and unlock secrets, leading to the ultimate goal of pulling off the perfect virtual heist. It's a playful mix of mystery, strategy, and tech-savvy fun designed to test participants' problem-solving skills in a captivating way. Prior knowledge is not required .Clues will be given for all the tasks encountered. Final Goal: Piece together all the clues to unlock the final mystery and complete the heist!",
    "image": "/events/cryptic-heist-poster.png",
    "rounds": [
      {
        "mode": "Online",
        "name": "The Cipher Shift",
        "date": "September 09, 2024",
        "info": "In this round, participants will decode encrypted messages using concepts like Binary, Decimal, Hexadecimal, Octal, and complements (9's, 2's, 1's). Teams must apply their knowledge to crack codes and solve puzzles. Login & Submission Rules: 1. Single Login Per Team: Each team must use only one partner ID to log in. Multiple IDs from the same team will not be considered. 2.First Submission Only: Only the first submission from each team will be taken into account. Ensure that your first submission is complete and correct. 3. Registered IDs Only: Only submissions from registered IDs will be accepted. Ensure your team's ID is registered before the event."
      },
      {
        "mode": "Offline",
        "name": "Cryptic Heist",
        "date": "September 11, 2024",
        "info": "In this final round, shortlisted teams will face challenges in the venue . Participants will dive into a thrilling online adventure where participants become digital detectives, solving puzzles, cracking codes, and uncovering hidden secrets to complete a high-stakes virtual heist in fun way. Instructions for the round 2: ● Assemble your crew and work together on-site—Here,Teamwork & Both Partner mindset are the strongest weapon in cracking the codes and solving the puzzles. ● Gadget Arsenal: Arm yourselves with essential decoding tools such as must bring your laptops, Bring Ethernet Cable if you have ● Time Heist: Plan your moves carefully—each puzzle gets trickier as the clock ticks. Efficient time management is crucial to your mission. ● Final Loot: Deliver the final decrypted code in person to the game masters. Ensure your solution is flawless before making the drop."
      }
    ],
    "instructions": "",
    "venue": "To be decided",
    "last-date": "September 7, 2024 (10:00 AM)",
    "form-link": "https://forms.gle/XcMPAmqLDCcVo3hP9",
    "group-link": "https://chat.whatsapp.com/",
    "brochure-link": "/events/cryptic-heist-brochure.png",
    "coordinators": [
      {
        "name": "Vaishnavi S",
        "phone": "+91 - 82482 72707",
        "type": "Student"
      },
      {
        "name": "Pavithra R",
        "phone": "+91 97898 43026",
        "type": "Student"
      },
      {
        "name": "Mr. G Yuvaraj",
        "phone": "+91 80988 57554",
        "type": "Staff"
      }
    ],
    "team": "Group of 2",
    "reporting-time": "9:00 AM"
  },
  "dev-quest": {
    "name": "DevQuest",
    "info": "DevQuest is an intuitive coding event spread across three challenging and interactive rounds. This event will feature a variety of coding tasks that require innovative thinking and a deep understanding of the time and space complexities involved in solving problems. Participants will have the opportunity to demonstrate their ability to write clean, efficient code and to think critically under pressure. With a focus on both individual excellence and collaborative problem-solving, the DevQuest Challenge promises to be an unforgettable experience for all who participate.",
    "image": "/events/devquest-poster.jpg",
    "rounds": [
      {
        "mode": "Online",
        "name": "BitBattle",
        "date": "September 09, 2024",
        "info": "The first round will be conducted online via Google Meet. Based on the number of registrations, the Google Meet session will be held in one or two slots. A quiz consisting of 20 questions based on computer technologies such as Python, Java, HTML, and CSS will be conducted through the Quizizz platform. Based on the rankings, the top-performing boys and girls will be selected"
      },
      {
        "mode": "Offline",
        "name": "Efficiency Showdown",
        "date": "September 11, 2024",
        "info": "Participants will be presented with a complex code that suffers from high time and space complexity. Their mission is to optimize this code, significantly reducing its time complexity within a specified time limit. This round will test their ability to think critically and apply advanced optimization techniques under pressure. Participants who successfully complete this challenge will advance to the next round. This round promises to be intense and exhilarating, pushing participants to their limits and rewarding those who can deliver optimal solutions swiftly"
      },
      {
        "mode": "Offline",
        "name": "Mystery Round",
        "date": "September 11, 2024",
        "time": "To be decided",
        "info": "Prepare yourself for the Enigma Unveiled round, a thrilling and unpredictable challenge that will be revealed only at the moment it begins. This round is shrouded in secrecy, designed to test your adaptability, quick thinking, and problem-solving skills in unexpected ways. Participants will face a unique and exciting task that could range from coding puzzles to algorithmic challenges. The specifics of the round will remain a mystery until it unfolds, adding an element of suspense and excitement to the competition. Are you ready to embrace the unknown and rise to the challenge?"
      }
    ],
    "instructions": "Points will be awarded in each round based on the individual's performance. All participants must participate in each round as per the round-specific instructions. Every participant must bring their own laptops and ethernet cables.",
    "venue": "To be decided",
    "last-date": "September 7, 2024 (10:00 AM)",
    "form-link": "https://docs.google.com/forms/d/e/1FAIpQLSepeTuI3S7UExZaJ0UHFpIYMgMtxaOmeC00i9blAFEDzDrHDA/viewform?usp=sf_link",
    "group-link": "https://chat.whatsapp.com/",
    "brochure-link": "/events/devquest-brochure.jpg",
    "coordinators": [
      {
        "name": "Nishanth P",
        "phone": "+91 - 93428 70058",
        "type": "Student"
      },
      {
        "name": "Indhumathi S",
        "phone": "+91 70102 94950",
        "type": "Student"
      },
      {
        "name": "Mr. M  Ahsan Shariff",
        "phone": "+91 98409 48078",
        "type": "Staff"
      }
    ],
    "team": "Individual Participation",
    "reporting-time": "9:00 AM"
  },
  "voyage-of-visions": {
    "name": "Voyage of Visions",
    "info": "A dynamic paper presentation event that encourages participants to explore the vast seas of technology and innovation. Dive deep into your area of expertise and share groundbreaking research and fresh ideas across various technological fields. Presenters are invited to chart new courses in science, engineering, and digital innovation, contributing to a diverse knowledge pool. This event provides a platform to showcase your work to a panel of esteemed experts, connect with like-minded peers, and make significant waves in the world of technology. Whether you're focused on AI, environmental sustainability, or cutting-edge engineering, welcomes you to navigate the future of technology with your unique perspectives",
    "image": "/events/voyage-of-visions-poster.jpg",
    "rounds": [
      {
        "mode": "Online",
        "name": "Virtual voyage",
        "date": "September 09, 2024",
        "info": "1.Submit your ideas and presentations using the designated Google form 2.Highlight the practical applications and real-world implications of your innovative concepts. 3.Selection criteria will emphasize the potential impact and feasibility of your innovation. 4.Adhere to the submission deadline to ensure your work is reviewed and considered."
      },
      {
        "mode": "Offline",
        "name": "In-person plunge",
        "date": "September 11, 2024",
        "info": "1.Teams shortlisted from Round 1 are eligible to advance to the offline presentation round. 2.Each team will be allocated 3-5 minutes for their presentation. 3.Emphasize the practical implementation and refinement of your innovations. 4.Present your work to the judging panel for final evaluation. 5.Judging will be based on the potential impact and practicality of your innovations."
      }
    ],
    "instructions": "1.Teams should consist of 2-3 members, fostering collaboration and incorporating diverse perspectives. 2.Emphasize transforming ideas into practical and commercially viable products or services. 3. Register on or before 08.09.2024 (11:59 pm). 4.Participants should report at 9:00 am to the venue. 5. Each team will be given 3 to 5 minutes for presentation and there will be a questioning session.",
    "venue": "To be decided",
    "last-date": "September 08, 2024 (5:00 PM)",
    "form-link": "https://forms.gle/wXFUvLB5B7xknmpA6",
    "group-link": "https://chat.whatsapp.com/",
    "brochure-link": "/events/voyage-of-visions-brochure.jpg",
    "coordinators": [
      {
        "name": "Niveditha S",
        "phone": "+91 - 80560 71373",
        "type": "Student"
      },
      {
        "name": "Prajith B",
        "phone": "+91 94897 14682",
        "type": "Student"
      },
      {
        "name": "Ms. Saradha Devi",
        "phone": "+91 96291 05564",
        "type": "Staff"
      }
    ],
    "team": "Group of 2 or 3",
    "reporting-time": "9:00 AM"
  },
  "craft-wave": {
    "name": "Craft Wave",
    "info": "CraftWave is a creative and environmentally-focused competition designed to raise awareness about ocean pollution caused by improper waste disposal. Participants will engage in a series of challenges that combine art, innovation, and sustainability. The event aims to inspire practical solutions through creative expression, emphasizing the importance of protecting our oceans. The event is divided into three rounds, each testing the participants' creativity, resourcefulness, and commitment to reducing ocean pollution.",
    "image": "/events/craft-wave-poster.png",
    "rounds": [
      {
        "mode": "Online",
        "name": "Design for the Ocean",
        "date": "September 09, 2024",
        "info": "In this round, participants must submit a design, awareness poster, or logo that highlights the issue of ocean pollution caused by improper waste disposal. The designs should be impactful and thought-provoking, aiming to educate and inspire action. The best submissions will be selected for the next round."
      },
      {
        "mode": "Offline",
        "name": "Crafting for Change",
        "date": "September 11, 2024",
        "info": "elected participants will be provided with lots containing different waste materials such as newspapers, ice sticks, wool, or other items commonly found as ocean pollutants. Using these materials, they must construct a useful craft that reflects their understanding of the environmental impact and showcases their ability to repurpose waste into something valuable. This round will take place in person, where creativity and innovation are key."
      },
      {
        "mode": "Offline",
        "name": "Presenting the Solution",
        "date": "September 11, 2024",
        "info": "In the final round, participants will present their crafted item to the judges, explaining how it contributes to reducing ocean pollution or how it represents a sustainable solution. This presentation will be critical in determining the overall impact and effectiveness of the craft in addressing environmental issues."
      }
    ],
    "instructions": "All designs for the first round must be original and submitted by the deadline. Participants are required to be present at the venue for the second and third rounds. Craft materials will be provided based on lots drawn by the participants. The main property on which the craft will be constructed, such as plastic bottles, newspapers, or ice sticks, will be provided by the organizers. Participants must bring other essential materials, including scissors, glue, cutters, and decorative items like paint and colored paper. Presentations should be concise and focus on the environmental benefits of the crafted item.",
    "venue": "To be decided",
    "last-date": "September 7, 2024 (10:00 AM)",
    "form-link": "https://forms.gle/V9GQiUtKmN7PN7qr8",
    "group-link": "https://chat.whatsapp.com/LyUWlgPYKWsFgB1Y5WF9H6",
    "brochure-link": "/events/craft-wave-brochure.png",
    "coordinators": [
      {
        "name": "Yogitha M",
        "phone": "+91 - 97909 81152",
        "type": "Student"
      },
      {
        "name": "Swathika S",
        "phone": "+91 86677 33239",
        "type": "Student"
      },
      {
        "name": "Mr. LakshmiNarayanan",
        "phone": "+91 97907 03366",
        "type": "Staff"
      }
    ],
    "team": "1 or 2 Members",
    "reporting-time": "10:00 AM"
  },
  "madd-wars": {
    "name": "M.A.D.D Wars",
    "info": "Join us for an extraordinary celebration of some of the most iconic worlds of adventure, heroism, and magic. Immerse yourself in realms where legendary heroes, fantastical creatures, and timeless tales come to life. Whether you're drawn to epic battles, enchanted lands, or the vibrant universes of beloved characters, this event has something for every fan. Get ready to explore, create, and connect with others who share your passion for these unforgettable stories.",
    "image": "/events/madd-wars-poster.jpg",
    "rounds": [
      {
        "mode": "Online",
        "date": "September 09, 2024",
        "info": "Any 2 rounds out of these 3 will be conducted. Menti Quiz. Video Question Dialogue/Movie Clip. Dialogue Guessing"
      },
      {
        "mode": "Offline",
        "name": "Crafting for Change",
        "date": "September 11, 2024",
        "info": "Selected participants will be provided with lots containing different waste materials such as newspapers, ice sticks, wool, or other items commonly found as ocean pollutants. Using these materials, they must construct a useful craft that reflects their understanding of the environmental impact and showcases their ability to repurpose waste into something valuable. This round will take place in person, where creativity and innovation are key."
      },
      {
        "mode": "Offline",
        "name": "Guess the Character",
        "date": "September 11, 2024",
        "info": "Participants will be divided into teams of two. Each team will select a character and inform the set helper. Teams will then take turns asking each other yes/no questions to guess the character chosen by the opposing team. Each set is given a maximum of 7 minutes; if time exceeds, both teams receive no points. The round is expected to take approximately 40 minutes to complete."
      },
      {
        "mode": "Offline",
        "name": "What If?",
        "date": "September 11, 2024",
        "info": "Participants will explore various scenarios by spinning a wheel to pick a lot. A random scenario will be assigned based on the color or number they pick, which they will then brainstorm and develop further."
      }
    ],
    "instructions": "Participants are requested to join in the WhatsApp group link below!",
    "venue": "To be decided",
    "last-date": "September 7, 2024 (10:00 AM)",
    "form-link": "https://forms.gle/34j2G9tddSxpUKC4A",
    "group-link": "https://chat.whatsapp.com/IDXyv6pGCTF46BS7aiuaCg",
    "brochure-link": "/events/madd-wars-brochure.jpg",
    "coordinators": [
      {
        "name": "Roshan R S",
        "phone": "+91 - 98412 63009",
        "type": "Student"
      },
      {
        "name": "Praisy Sherlin",
        "phone": "+91 79043 18997",
        "type": "Student"
      },
      {
        "name": "Ms. Nandhini Devi",
        "phone": "+91 90945 82990",
        "type": "Staff"
      }
    ],
    "team": "2 or 3 Members",
    "reporting-time": "10:00 AM"
  }
}
